wolaite2024/jlab-jh5003-earphone/src/mcu/rtl87x3/arm/startup_rtl87x3ep.s
;/*****************************************************************************/
;/*     startup_rtl8763.s: Startup file for Realtek RTL8763 device series     */
;/*****************************************************************************/
#include "mem_config.h"

__initial_sp    EQU     APP_GLOBAL_ADDR

                PRESERVE8
                THUMB

; Vector Table Mapped to Address 0 at Reset

                AREA    VECTOR, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp              ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler
                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     Default_Handler
                DCD     Default_Handler
                DCD     Default_Handler
                DCD     Default_Handler
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     Default_Handler
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; External Interrupts
                DCD     System_Handler
                DCD     WDT_Handler
                DCD     BTMAC_Handler
                DCD     DSP_Handler
                DCD     RXI300_Handler
                DCD     SPI0_Handler
                DCD     I2C0_Handler
                DCD     ADC_Handler
                DCD     SPORT0_TX_Handler
                DCD     SPORT0_RX_Handler
                DCD     TIM2_Handler
                DCD     TIM3_Handler
                DCD     TIM4_Handler
                DCD     RTC_Handler
                DCD     UART0_Handler
                DCD     UART1_Handler
                DCD     UART2_Handler
                DCD     Peri_Handler
                DCD     GPIO_A0_Handler
                DCD     GPIO_A1_Handler
                DCD     GPIO_A_2_7_Handler
                DCD     GPIO_A_8_15_Handler
                DCD     GPIO_A_16_23_Handler
                DCD     GPIO_A_24_31_Handler
                DCD     SPORT1_RX_Handler

                DCD     SPORT1_TX_Handler
                DCD     ADP_DET_Handler
                DCD     VBAT_DET_Handler
                DCD     GDMA0_Channel0_Handler
                DCD     GDMA0_Channel1_Handler
                DCD     GDMA0_Channel2_Handler
                DCD     GDMA0_Channel3_Handler
                DCD     GDMA0_Channel4_Handler
                DCD     GDMA0_Channel5_Handler
                DCD     GDMA0_Channel6_Handler
                DCD     GDMA0_Channel7_Handler
                DCD     GDMA0_Channel8_Handler
                DCD     GPIO_B_0_7_Handler
                DCD     GPIO_B_8_15_Handler
                DCD     GPIO_B_16_23_Handler
                DCD     GPIO_B_24_31_Handler
                DCD     SPI1_Handler
                DCD     SPI2_Handler
                DCD     I2C1_Handler
                DCD     I2C2_Handler
                DCD     KeyScan_Handler
                DCD     QDEC_Handler
                DCD     USB_Handler
                DCD     USB_ISOC_Handler
                DCD     SPIC0_Handler
                DCD     SPIC1_Handler
                DCD     SPIC2_Handler
                DCD     SPIC3_Handler
                DCD     TIM5_Handler
                DCD     TIM6_Handler
                DCD     TIM7_Handler
                DCD     ASRC0_Handler
                DCD     ASRC1_Handler
                DCD     I8080_Handler
                DCD     ISO7816_Handler
                DCD     SDIO0_Handler
                DCD     SPORT2_RX_Handler
                DCD     ANC_Handler
                DCD     TOUCH_Handler

                DCD     GDMA0_Channel9_Handler
                DCD     GDMA0_Channel10_Handler
                DCD     GDMA0_Channel11_Handler
                DCD     Display_Handler
                DCD     PPE_Handler
                DCD     IDU_Handler
                DCD     Slave_Port_Monitor_Handler
                DCD     RTK_Timer0_Handler
                DCD     RTK_Timer1_Handler
                DCD     RTK_Timer2_Handler
                DCD     RTK_Timer3_Handler
                DCD     CAN_Handler
                DCD     BTMAC_WRAP_AROUND_Handler
                DCD     SHA256_Handler
                DCD     Public_Key_Engine_Handler
                DCD     SPI_PHY1_INTR_Handler

                DCD     MFB_DET_L_Handler
                DCD     PTA_Mailbox_Handler
                DCD     Utmi_Suspend_N_Handler
                DCD     IR_Handler
                DCD     TRNG_Handler
                DCD     PSRAMC_Handler
                DCD     LPCOMP_Handler
                DCD     TIM5_Handler
                DCD     TIM6_Handler
                DCD     TIM7_Handler
                DCD     Default_Handler
                DCD     LPCOMP_Handler
                DCD     VBAT_DET_Handler
                DCD     ADP_DET_Handler

                DCD     ADP_IN_DET_Handler
                DCD     ADP_OUT_DET_Handler
                DCD     GPIOA2_Handler
                DCD     GPIOA3_Handler
                DCD     GPIOA4_Handler
                DCD     GPIOA5_Handler
                DCD     GPIOA6_Handler
                DCD     GPIOA7_Handler
                DCD     GPIOA8_Handler
                DCD     GPIOA9_Handler
                DCD     GPIOA10_Handler
                DCD     GPIOA11_Handler
                DCD     GPIOA12_Handler
                DCD     GPIOA13_Handler
                DCD     GPIOA14_Handler
                DCD     GPIOA15_Handler
                DCD     GPIOA16_Handler
                DCD     GPIOA17_Handler
                DCD     GPIOA18_Handler
                DCD     GPIOA19_Handler
                DCD     GPIOA20_Handler
                DCD     GPIOA21_Handler
                DCD     GPIOA22_Handler
                DCD     GPIOA23_Handler
                DCD     GPIOA24_Handler
                DCD     GPIOA25_Handler
                DCD     GPIOA26_Handler
                DCD     GPIOA27_Handler
                DCD     GPIOA28_Handler
                DCD     GPIOA29_Handler
                DCD     GPIOA30_Handler
                DCD     GPIOA31_Handler
                DCD     GPIOB0_Handler
                DCD     GPIOB1_Handler
                DCD     GPIOB2_Handler
                DCD     GPIOB3_Handler
                DCD     GPIOB4_Handler
                DCD     GPIOB5_Handler
                DCD     GPIOB6_Handler
                DCD     GPIOB7_Handler
                DCD     GPIOB8_Handler
                DCD     GPIOB9_Handler
                DCD     GPIOB10_Handler
                DCD     GPIOB11_Handler
                DCD     GPIOB12_Handler
                DCD     GPIOB13_Handler
                DCD     GPIOB14_Handler
                DCD     GPIOB15_Handler
                DCD     GPIOB16_Handler
                DCD     GPIOB17_Handler
                DCD     GPIOB18_Handler
                DCD     GPIOB19_Handler
                DCD     GPIOB20_Handler
                DCD     GPIOB21_Handler
                DCD     GPIOB22_Handler
                DCD     GPIOB23_Handler
                DCD     GPIOB24_Handler
                DCD     GPIOB25_Handler
                DCD     GPIOB26_Handler
                DCD     GPIOB27_Handler
                DCD     GPIOB28_Handler
                DCD     GPIOB29_Handler
                DCD     GPIOB30_Handler
                DCD     GPIOB31_Handler
__Vectors_End


__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    RESET, CODE, READONLY

