wolaite2024/jlab-jh5003-earphone/src/mcu/rtl87x3/arm/startup_rtl87x3ep.s
; Reset Handler
Reset_Handler   PROC
                EXPORT Reset_Handler               [WEAK]
                IMPORT system_init
                IMPORT __main

                IF     :DEF:__USE_C_LIBRARY_INIT; // use c library init

                LDR    R0, =system_init
                BLX    R0
                LDR    R0, =__main
                BX     R0

                ELSE

                ; write our init flow: copy rw, encrypted and clear zi
                ; data on rw, data on zi, buffer on rw, buffer on zi

                ; copy data on rw
                IMPORT |Load$$RAM_GLOBAL$$RW$$Base|
                IMPORT |Image$$RAM_GLOBAL$$RW$$Base|
                IMPORT |Image$$RAM_GLOBAL$$RW$$Length|
                LDR R0, =|Load$$RAM_GLOBAL$$RW$$Base|
                LDR R1, =|Image$$RAM_GLOBAL$$RW$$Base|
                LDR R2, =|Image$$RAM_GLOBAL$$RW$$Length|
                CMP R2, #0
                BEQ end_of_copy_data_on_rw
copy_data_on_rw
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_data_on_rw
end_of_copy_data_on_rw

                ; clear data on zi
                IMPORT |Image$$RAM_GLOBAL$$ZI$$Base|
                IMPORT |Image$$RAM_GLOBAL$$ZI$$Length|
                LDR R0, =|Image$$RAM_GLOBAL$$ZI$$Base|
                LDR R1, =|Image$$RAM_GLOBAL$$ZI$$Length|
                CMP R1, #0
                BEQ end_of_clear_data_on_zi
clear_data_on_zi
                STR R2, [R0]
                ADDS R0, R0, #4
                SUBS R1, R1, #4
                BNE clear_data_on_zi
end_of_clear_data_on_zi

                ; copy buffer on rw
                IMPORT |Load$$RAM_TEXT$$RW$$Base|
                IMPORT |Image$$RAM_TEXT$$RW$$Base|
                IMPORT |Image$$RAM_TEXT$$RW$$Length|
                LDR R0, =|Load$$RAM_TEXT$$RW$$Base|
                LDR R1, =|Image$$RAM_TEXT$$RW$$Base|
                LDR R2, =|Image$$RAM_TEXT$$RW$$Length|
                CMP R2, #0
                BEQ end_of_copy_buffer_on_rw
copy_buffer_on_rw
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_buffer_on_rw
end_of_copy_buffer_on_rw

                ; copy buffer on ro (for ram function)
                IMPORT |Load$$RAM_TEXT$$RO$$Base|
                IMPORT |Image$$RAM_TEXT$$RO$$Base|
                IMPORT |Image$$RAM_TEXT$$RO$$Length|
                LDR R0, =|Load$$RAM_TEXT$$RO$$Base|
                LDR R1, =|Image$$RAM_TEXT$$RO$$Base|
                LDR R2, =|Image$$RAM_TEXT$$RO$$Length|
                CMP R2, #0
                BEQ end_of_copy_buffer_on_ro
copy_buffer_on_ro
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_buffer_on_ro
end_of_copy_buffer_on_ro

                ; clear buffer on zi
                IMPORT |Image$$RAM_TEXT$$ZI$$Base|
                IMPORT |Image$$RAM_TEXT$$ZI$$Length|
                LDR R0, =|Image$$RAM_TEXT$$ZI$$Base|
                LDR R1, =|Image$$RAM_TEXT$$ZI$$Length|
                CMP R1, #0
                BEQ end_of_clear_buffer_on_zi
clear_buffer_on_zi
                STR R2, [R0]
                ADDS R0, R0, #4
                SUBS R1, R1, #4
                BNE clear_buffer_on_zi
                NOP
end_of_clear_buffer_on_zi


                IMPORT system_init
                IMPORT main
                LDR    R0, =system_init
                BLX    R0
                LDR    R0, =main
                BX     R0

                ENDIF ; end of macro __USE_C_LIBRARY_INIT

                ENDP ; end of Reset_Handler

                AREA    |.text|, CODE, READONLY
Default_Handler PROC
                EXPORT Default_Handler           [WEAK]

                EXPORT NMI_Handler        [WEAK]
                EXPORT HardFault_Handler        [WEAK]
                EXPORT MemManage_Handler        [WEAK]
                EXPORT BusFault_Handler        [WEAK]
                EXPORT UsageFault_Handler        [WEAK]
                EXPORT Default_Handler        [WEAK]
                EXPORT Default_Handler        [WEAK]
                EXPORT Default_Handler        [WEAK]
                EXPORT Default_Handler        [WEAK]
                EXPORT SVC_Handler        [WEAK]
                EXPORT DebugMon_Handler        [WEAK]
                EXPORT Default_Handler        [WEAK]
                EXPORT PendSV_Handler        [WEAK]
                EXPORT SysTick_Handler        [WEAK]

                ;ExternalInterrupts
                EXPORT System_Handler        [WEAK]
                EXPORT WDT_Handler        [WEAK]
                EXPORT BTMAC_Handler        [WEAK]
                EXPORT DSP_Handler        [WEAK]
                EXPORT RXI300_Handler        [WEAK]
                EXPORT SPI0_Handler        [WEAK]
                EXPORT I2C0_Handler        [WEAK]
                EXPORT ADC_Handler        [WEAK]
                EXPORT SPORT0_TX_Handler        [WEAK]
                EXPORT SPORT0_RX_Handler        [WEAK]
                EXPORT TIM2_Handler        [WEAK]
                EXPORT TIM3_Handler        [WEAK]
                EXPORT TIM4_Handler        [WEAK]
                EXPORT RTC_Handler        [WEAK]
                EXPORT UART0_Handler        [WEAK]
                EXPORT UART1_Handler        [WEAK]
                EXPORT UART2_Handler        [WEAK]
                EXPORT Peri_Handler        [WEAK]
                EXPORT GPIO_A0_Handler        [WEAK]
                EXPORT GPIO_A1_Handler        [WEAK]
                EXPORT GPIO_A_2_7_Handler        [WEAK]
                EXPORT GPIO_A_8_15_Handler        [WEAK]
                EXPORT GPIO_A_16_23_Handler        [WEAK]
                EXPORT GPIO_A_24_31_Handler        [WEAK]
                EXPORT SPORT1_RX_Handler        [WEAK]

                EXPORT SPORT1_TX_Handler        [WEAK]
                EXPORT ADP_DET_Handler        [WEAK]
                EXPORT VBAT_DET_Handler        [WEAK]
                EXPORT GDMA0_Channel0_Handler        [WEAK]
                EXPORT GDMA0_Channel1_Handler        [WEAK]
                EXPORT GDMA0_Channel2_Handler        [WEAK]
                EXPORT GDMA0_Channel3_Handler        [WEAK]
                EXPORT GDMA0_Channel4_Handler        [WEAK]
                EXPORT GDMA0_Channel5_Handler        [WEAK]
                EXPORT GDMA0_Channel6_Handler        [WEAK]
                EXPORT GDMA0_Channel7_Handler        [WEAK]
                EXPORT GDMA0_Channel8_Handler        [WEAK]
                EXPORT GPIO_B_0_7_Handler        [WEAK]
                EXPORT GPIO_B_8_15_Handler        [WEAK]
                EXPORT GPIO_B_16_23_Handler        [WEAK]
                EXPORT GPIO_B_24_31_Handler        [WEAK]
                EXPORT SPI1_Handler        [WEAK]
                EXPORT SPI2_Handler        [WEAK]
                EXPORT I2C1_Handler        [WEAK]
                EXPORT I2C2_Handler        [WEAK]
                EXPORT KeyScan_Handler        [WEAK]
                EXPORT QDEC_Handler        [WEAK]
                EXPORT USB_Handler        [WEAK]
                EXPORT USB_ISOC_Handler        [WEAK]
                EXPORT SPIC0_Handler        [WEAK]
                EXPORT SPIC1_Handler        [WEAK]
                EXPORT SPIC2_Handler        [WEAK]
                EXPORT SPIC3_Handler        [WEAK]
                EXPORT TIM5_Handler        [WEAK]
                EXPORT TIM6_Handler        [WEAK]
                EXPORT TIM7_Handler        [WEAK]
                EXPORT ASRC0_Handler        [WEAK]
                EXPORT ASRC1_Handler        [WEAK]
                EXPORT I8080_Handler        [WEAK]
                EXPORT ISO7816_Handler        [WEAK]
                EXPORT SDIO0_Handler        [WEAK]
                EXPORT SPORT2_RX_Handler        [WEAK]
                EXPORT ANC_Handler        [WEAK]
                EXPORT TOUCH_Handler        [WEAK]

