wolaite2024/jlab-jh5003-earphone/src/mcu/rtl87x3/arm/startup_rtl87x3ep.s
                EXPORT GDMA0_Channel9_Handler        [WEAK]
                EXPORT GDMA0_Channel10_Handler        [WEAK]
                EXPORT GDMA0_Channel11_Handler        [WEAK]
                EXPORT Display_Handler        [WEAK]
                EXPORT PPE_Handler        [WEAK]
                EXPORT IDU_Handler        [WEAK]
                EXPORT Slave_Port_Monitor_Handler        [WEAK]
                EXPORT RTK_Timer0_Handler        [WEAK]
                EXPORT RTK_Timer1_Handler        [WEAK]
                EXPORT RTK_Timer2_Handler        [WEAK]
                EXPORT RTK_Timer3_Handler        [WEAK]
                EXPORT CAN_Handler        [WEAK]
                EXPORT BTMAC_WRAP_AROUND_Handler        [WEAK]
                EXPORT SHA256_Handler        [WEAK]
                EXPORT Public_Key_Engine_Handler        [WEAK]
                EXPORT SPI_PHY1_INTR_Handler        [WEAK]

                EXPORT MFB_DET_L_Handler        [WEAK]
                EXPORT PTA_Mailbox_Handler        [WEAK]
                EXPORT Utmi_Suspend_N_Handler        [WEAK]
                EXPORT IR_Handler        [WEAK]
                EXPORT TRNG_Handler        [WEAK]
                EXPORT PSRAMC_Handler        [WEAK]
                EXPORT LPCOMP_Handler        [WEAK]
                EXPORT TIM5_Handler        [WEAK]
                EXPORT TIM6_Handler        [WEAK]
                EXPORT TIM7_Handler        [WEAK]
                EXPORT Default_Handler        [WEAK]
                EXPORT LPCOMP_Handler        [WEAK]
                EXPORT VBAT_DET_Handler        [WEAK]
                EXPORT ADP_DET_Handler        [WEAK]

                EXPORT ADP_IN_DET_Handler        [WEAK]
                EXPORT ADP_OUT_DET_Handler        [WEAK]
                EXPORT GPIOA2_Handler        [WEAK]
                EXPORT GPIOA3_Handler        [WEAK]
                EXPORT GPIOA4_Handler        [WEAK]
                EXPORT GPIOA5_Handler        [WEAK]
                EXPORT GPIOA6_Handler        [WEAK]
                EXPORT GPIOA7_Handler        [WEAK]
                EXPORT GPIOA8_Handler        [WEAK]
                EXPORT GPIOA9_Handler        [WEAK]
                EXPORT GPIOA10_Handler        [WEAK]
                EXPORT GPIOA11_Handler        [WEAK]
                EXPORT GPIOA12_Handler        [WEAK]
                EXPORT GPIOA13_Handler        [WEAK]
                EXPORT GPIOA14_Handler        [WEAK]
                EXPORT GPIOA15_Handler        [WEAK]
                EXPORT GPIOA16_Handler        [WEAK]
                EXPORT GPIOA17_Handler        [WEAK]
                EXPORT GPIOA18_Handler        [WEAK]
                EXPORT GPIOA19_Handler        [WEAK]
                EXPORT GPIOA20_Handler        [WEAK]
                EXPORT GPIOA21_Handler        [WEAK]
                EXPORT GPIOA22_Handler        [WEAK]
                EXPORT GPIOA23_Handler        [WEAK]
                EXPORT GPIOA24_Handler        [WEAK]
                EXPORT GPIOA25_Handler        [WEAK]
                EXPORT GPIOA26_Handler        [WEAK]
                EXPORT GPIOA27_Handler        [WEAK]
                EXPORT GPIOA28_Handler        [WEAK]
                EXPORT GPIOA29_Handler        [WEAK]
                EXPORT GPIOA30_Handler        [WEAK]
                EXPORT GPIOA31_Handler        [WEAK]
                EXPORT GPIOB0_Handler        [WEAK]
                EXPORT GPIOB1_Handler        [WEAK]
                EXPORT GPIOB2_Handler        [WEAK]
                EXPORT GPIOB3_Handler        [WEAK]
                EXPORT GPIOB4_Handler        [WEAK]
                EXPORT GPIOB5_Handler        [WEAK]
                EXPORT GPIOB6_Handler        [WEAK]
                EXPORT GPIOB7_Handler        [WEAK]
                EXPORT GPIOB8_Handler        [WEAK]
                EXPORT GPIOB9_Handler        [WEAK]
                EXPORT GPIOB10_Handler        [WEAK]
                EXPORT GPIOB11_Handler        [WEAK]
                EXPORT GPIOB12_Handler        [WEAK]
                EXPORT GPIOB13_Handler        [WEAK]
                EXPORT GPIOB14_Handler        [WEAK]
                EXPORT GPIOB15_Handler        [WEAK]
                EXPORT GPIOB16_Handler        [WEAK]
                EXPORT GPIOB17_Handler        [WEAK]
                EXPORT GPIOB18_Handler        [WEAK]
                EXPORT GPIOB19_Handler        [WEAK]
                EXPORT GPIOB20_Handler        [WEAK]
                EXPORT GPIOB21_Handler        [WEAK]
                EXPORT GPIOB22_Handler        [WEAK]
                EXPORT GPIOB23_Handler        [WEAK]
                EXPORT GPIOB24_Handler        [WEAK]
                EXPORT GPIOB25_Handler        [WEAK]
                EXPORT GPIOB26_Handler        [WEAK]
                EXPORT GPIOB27_Handler        [WEAK]
                EXPORT GPIOB28_Handler        [WEAK]
                EXPORT GPIOB29_Handler        [WEAK]
                EXPORT GPIOB30_Handler        [WEAK]
                EXPORT GPIOB31_Handler        [WEAK]

NMI_Handler
HardFault_Handler
MemManage_Handler
BusFault_Handler
UsageFault_Handler
SVC_Handler
DebugMon_Handler
PendSV_Handler
SysTick_Handler

; ExternalInterrupts
System_Handler
WDT_Handler
BTMAC_Handler
DSP_Handler
RXI300_Handler
SPI0_Handler
I2C0_Handler
ADC_Handler
SPORT0_TX_Handler
SPORT0_RX_Handler
TIM2_Handler
TIM3_Handler
TIM4_Handler
RTC_Handler
UART0_Handler
UART1_Handler
UART2_Handler
Peri_Handler
GPIO_A0_Handler
GPIO_A1_Handler
GPIO_A_2_7_Handler
GPIO_A_8_15_Handler
GPIO_A_16_23_Handler
GPIO_A_24_31_Handler
SPORT1_RX_Handler

SPORT1_TX_Handler
ADP_DET_Handler
VBAT_DET_Handler
GDMA0_Channel0_Handler
GDMA0_Channel1_Handler
GDMA0_Channel2_Handler
GDMA0_Channel3_Handler
GDMA0_Channel4_Handler
GDMA0_Channel5_Handler
GDMA0_Channel6_Handler
GDMA0_Channel7_Handler
GDMA0_Channel8_Handler
GPIO_B_0_7_Handler
GPIO_B_8_15_Handler
GPIO_B_16_23_Handler
GPIO_B_24_31_Handler
SPI1_Handler
SPI2_Handler
I2C1_Handler
I2C2_Handler
KeyScan_Handler
QDEC_Handler
USB_Handler
USB_ISOC_Handler
SPIC0_Handler
SPIC1_Handler
SPIC2_Handler
SPIC3_Handler
TIM5_Handler
TIM6_Handler
TIM7_Handler
ASRC0_Handler
ASRC1_Handler
I8080_Handler
ISO7816_Handler
SDIO0_Handler
SPORT2_RX_Handler
ANC_Handler
TOUCH_Handler

GDMA0_Channel9_Handler
GDMA0_Channel10_Handler
GDMA0_Channel11_Handler
Display_Handler
PPE_Handler
IDU_Handler
Slave_Port_Monitor_Handler
RTK_Timer0_Handler
RTK_Timer1_Handler
RTK_Timer2_Handler
RTK_Timer3_Handler
CAN_Handler
BTMAC_WRAP_AROUND_Handler
SHA256_Handler
Public_Key_Engine_Handler
SPI_PHY1_INTR_Handler

MFB_DET_L_Handler
PTA_Mailbox_Handler
Utmi_Suspend_N_Handler
IR_Handler
TRNG_Handler
PSRAMC_Handler
LPCOMP_Handler
ADP_IN_DET_Handler
ADP_OUT_DET_Handler
GPIOA2_Handler
GPIOA3_Handler
GPIOA4_Handler
GPIOA5_Handler
GPIOA6_Handler
GPIOA7_Handler
GPIOA8_Handler
GPIOA9_Handler
GPIOA10_Handler
GPIOA11_Handler
GPIOA12_Handler
GPIOA13_Handler
GPIOA14_Handler
GPIOA15_Handler
GPIOA16_Handler
GPIOA17_Handler
GPIOA18_Handler
GPIOA19_Handler
GPIOA20_Handler
GPIOA21_Handler
GPIOA22_Handler
GPIOA23_Handler
GPIOA24_Handler
GPIOA25_Handler
GPIOA26_Handler
GPIOA27_Handler
GPIOA28_Handler
GPIOA29_Handler
GPIOA30_Handler
GPIOA31_Handler
GPIOB0_Handler
GPIOB1_Handler
GPIOB2_Handler
GPIOB3_Handler
GPIOB4_Handler
GPIOB5_Handler
GPIOB6_Handler
GPIOB7_Handler
GPIOB8_Handler
GPIOB9_Handler
GPIOB10_Handler
GPIOB11_Handler
GPIOB12_Handler
GPIOB13_Handler
GPIOB14_Handler
GPIOB15_Handler
GPIOB16_Handler
GPIOB17_Handler
GPIOB18_Handler
GPIOB19_Handler
GPIOB20_Handler
GPIOB21_Handler
GPIOB22_Handler
GPIOB23_Handler
GPIOB24_Handler
GPIOB25_Handler
GPIOB26_Handler
GPIOB27_Handler
GPIOB28_Handler
GPIOB29_Handler
GPIOB30_Handler
GPIOB31_Handler
                IMPORT log_direct
                LDR    R0, =0x20000000
                LDR    R1, =DEFAULT_HANDLER_TXT
                MRS    R2, IPSR
                LDR    R3, =log_direct
                BLX    R3
                B      .

                ENDP


; User Initial Stack
                EXPORT  __user_setup_stackheap
__user_setup_stackheap PROC
                BX      LR
                ENDP

DEFAULT_HANDLER_TXT
                DCB "Error! Please implement your ISR Handler for IRQ %d!\n", 0 ; Null terminated string
                ALIGN

                END
